In [1]:
import pandas as pd;
import numpy as np;
import matplotlib.pyplot as plt;
import seaborn as sns;

In [11]:
data = pd.read_csv('ml_dummy_data.csv')
data.set_index('id')

,age,salary,gender,city,experience_years,department,score,is_active,joining_year
id,,,,,,,,,
1.0,56.0,25408.0,Female,Bangalore,2.0,Finance,65.083322,True,2009.0
2.0,69.0,79379.0,Male,Chennai,18.0,Finance,61.506463,False,2002.0
3.0,46.0,45053.0,Male,Pune,2.0,Marketing,17.567210,True,2022.0
4.0,32.0,29446.0,NaN,Delhi,13.0,Support,51.318989,True,2016.0
5.0,60.0,20922.0,Male,Bangalore,7.0,IT,71.538102,False,2007.0
...,...,...,...,...,...,...,...,...,...
171.0,46.0,68770.0,Female,Delhi,8.0,IT,81.479367,True,2001.0
524.0,33.0,66600.0,Other,Bangalore,11.0,NaN,67.888734,False,2018.0
766.0,25.0,25109.0,Female,Pune,10.0,IT,9.664058,False,2021.0
839.0,27.0,33629.0,Male,Pune,12.0,HR,23.437009,True,2015.0
424.0,43.0,22983.0,Other,Bangalore,11.0,Finance,57.392914,False,2004.0

In [12]:
data.shape

(1220, 10)

In [17]:
data.head()

,id,age,salary,gender,city,experience_years,department,score,is_active,joining_year
0,1.0,56.0,25408.0,Female,Bangalore,2.0,Finance,65.083322,True,2009.0
1,2.0,69.0,79379.0,Male,Chennai,18.0,Finance,61.506463,False,2002.0
2,3.0,46.0,45053.0,Male,Pune,2.0,Marketing,17.567210,True,2022.0
3,4.0,32.0,29446.0,NaN,Delhi,13.0,Support,51.318989,True,2016.0
4,5.0,60.0,20922.0,Male,Bangalore,7.0,IT,71.538102,False,2007.0

In [18]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1220 entries, 0 to 1219
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id                1159 non-null   float64
 1   age               1159 non-null   float64
 2   salary            1160 non-null   float64
 3   gender            1160 non-null   object
 4   city              1159 non-null   object
 5   experience_years  1160 non-null   float64
 6   department        1158 non-null   object
 7   score             1159 non-null   float64
 8   is_active         1160 non-null   object
 9   joining_year      1160 non-null   float64
dtypes: float64(6), object(4)
memory usage: 95.4+ KB

In [19]:
data.isnull().sum()

id                  61
age                 61
salary              60
gender              60
city                61
experience_years    60
department          62
score               61
is_active           60
joining_year        60
dtype: int64

In [20]:
data.duplicated().sum()

np.int64(20)

In [22]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1220 entries, 0 to 1219
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id                1159 non-null   float64
 1   age               1159 non-null   float64
 2   salary            1160 non-null   float64
 3   gender            1160 non-null   object
 4   city              1159 non-null   object
 5   experience_years  1160 non-null   float64
 6   department        1158 non-null   object
 7   score             1159 non-null   float64
 8   is_active         1160 non-null   object
 9   joining_year      1160 non-null   float64
dtypes: float64(6), object(4)
memory usage: 95.4+ KB

In [32]:
#Convert DataType...........................................................................................................
data['id'] = data['id'].astype('Int64')
data['age'] = data['age'].astype('Int64')
data['joining_year'] = data['joining_year'].astype('Int64')
data['experience_years'] = data['experience_years'].astype('Int64')

In [33]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1220 entries, 0 to 1219
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id                1159 non-null   Int64
 1   age               1159 non-null   Int64
 2   salary            1160 non-null   float64
 3   gender            1160 non-null   object
 4   city              1159 non-null   object
 5   experience_years  1160 non-null   Int64
 6   department        1158 non-null   object
 7   score             1159 non-null   float64
 8   is_active         1160 non-null   object
 9   joining_year      1160 non-null   Int64
dtypes: Int64(4), float64(2), object(4)
memory usage: 100.2+ KB

In [34]:
# Handling missing values......................................................................................................
data.isnull().sum()

id                  61
age                 61
salary              60
gender              60
city                61
experience_years    60
department          62
score               61
is_active           60
joining_year        60
dtype: int64

In [36]:
data['id'] = data['id'].fillna(-1)
# data = data.dropna(subset=['id'])

In [42]:
data.isnull().sum()

id                   0
age                 61
salary              60
gender              60
city                61
experience_years    60
department          62
score               61
is_active           60
joining_year        60
dtype: int64

In [51]:
col_data = ['age', 'salary', 'experience_years', 'score', 'joining_year']
for col in col_data:
    data[col] = data[col].fillna(data[col].median())

In [52]:
data.isnull().sum()

id                  0
age                 0
salary              0
gender              0
city                0
experience_years    0
department          0
score               0
is_active           0
joining_year        0
dtype: int64

In [53]:
cat_col = ['gender', 'city', 'department']
for col in cat_col: 
    data[col] = data[col].fillna(data[col].mode()[0])

In [54]:
data.isnull().sum()

id                  0
age                 0
salary              0
gender              0
city                0
experience_years    0
department          0
score               0
is_active           0
joining_year        0
dtype: int64

In [55]:
# data.duplicated().sum()........................................................................................................

In [57]:
data.duplicated().sum()

np.int64(20)

In [58]:
data[data.duplicated()]

,id,age,salary,gender,city,experience_years,department,score,is_active,joining_year
1200,1179,42,110025.0,Female,Pune,11,Marketing,62.237593,False,2015
1201,866,61,40022.0,Female,Delhi,4,Marketing,31.347736,True,2023
1202,102,18,28577.0,Male,Mumbai,17,HR,1.366169,True,2008
1203,440,68,94859.0,Male,Bangalore,0,IT,94.730000,True,2000
1204,59,24,59915.0,Female,Chennai,11,Finance,44.755186,True,2006
1205,1121,18,101889.0,Male,Pune,3,Marketing,83.319166,False,2018
1206,324,44,51987.0,Male,Mumbai,15,Support,93.147899,True,2024
1207,975,52,105112.0,Male,Chennai,5,HR,72.921095,False,2019
1208,412,59,37850.0,Female,Bangalore,0,Finance,21.772890,True,2022
1209,856,45,56877.0,Male,Chennai,14,Support,83.716196,False,2023
1210,821,51,88577.0,Female,Mumbai,14,Marketing,66.403303,False,2017
1211,45,38,20814.0,Other,Mumbai,7,Marketing,5.723669,True,2011
1212,-1,42,95916.0,Female,Mumbai,11,Marketing,26.272094,True,2009
1213,850,21,94137.0,Male,Chennai,6,Marketing,3.804918,True,2002
1214,241,49,39063.0,Male,Delhi,9,Support,49.604273,True,2023
1215,171,46,68770.0,Female,Delhi,8,IT,81.479367,True,2001
1216,524,33,66600.0,Other,Bangalore,11,HR,67.888734,False,2018
1217,766,25,25109.0,Female,Pune,10,IT,9.664058,False,2021
1218,839,27,33629.0,Male,Pune,12,HR,23.437009,True,2015
1219,424,43,22983.0,Other,Bangalore,11,Finance,57.392914,False,2004

In [59]:
data = data.drop_duplicates()

In [60]:
data

,id,age,salary,gender,city,experience_years,department,score,is_active,joining_year
0,1,56,25408.0,Female,Bangalore,2,Finance,65.083322,True,2009
1,2,69,79379.0,Male,Chennai,18,Finance,61.506463,False,2002
2,3,46,45053.0,Male,Pune,2,Marketing,17.567210,True,2022
3,4,32,29446.0,Male,Delhi,13,Support,51.318989,True,2016
4,5,60,20922.0,Male,Bangalore,7,IT,71.538102,False,2007
...,...,...,...,...,...,...,...,...,...,...
1195,1196,59,29435.0,Other,Chennai,10,Support,48.675105,True,2012
1196,1197,69,114088.0,Male,Bangalore,13,IT,70.232498,False,2010
1197,1198,32,72249.0,Other,Chennai,17,HR,85.196925,False,2001
1198,1199,64,57384.0,Male,Pune,15,Support,35.660891,False,2023
1199,1200,46,101929.0,Female,Delhi,2,Support,26.139732,True,2014

In [61]:
data.duplicated().sum()

np.int64(0)

In [62]:
data

,id,age,salary,gender,city,experience_years,department,score,is_active,joining_year
0,1,56,25408.0,Female,Bangalore,2,Finance,65.083322,True,2009
1,2,69,79379.0,Male,Chennai,18,Finance,61.506463,False,2002
2,3,46,45053.0,Male,Pune,2,Marketing,17.567210,True,2022
3,4,32,29446.0,Male,Delhi,13,Support,51.318989,True,2016
4,5,60,20922.0,Male,Bangalore,7,IT,71.538102,False,2007
...,...,...,...,...,...,...,...,...,...,...
1195,1196,59,29435.0,Other,Chennai,10,Support,48.675105,True,2012
1196,1197,69,114088.0,Male,Bangalore,13,IT,70.232498,False,2010
1197,1198,32,72249.0,Other,Chennai,17,HR,85.196925,False,2001
1198,1199,64,57384.0,Male,Pune,15,Support,35.660891,False,2023
1199,1200,46,101929.0,Female,Delhi,2,Support,26.139732,True,2014

In [63]:
data.shape

(1200, 10)

In [64]:
data.to_csv('Data.csv', index=False)